IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/EXT_FLASH0_EXT_FLASH0.xml
<module name="EXT_FLASH0_EXT_FLASH0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="EXT_FLASH0_EXT_FLASH_START" acronym="EXT_FLASH0_EXT_FLASH_START" offset="0x0" width="32" description="">
		<bitfield id="MEM_START" width="32" begin="31" end="0" resetval="0x0" description="External flash start Address" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="EXT_FLASH0_EXT_FLASH_END" acronym="EXT_FLASH0_EXT_FLASH_END" offset="0x1FFFFFC" width="32" description="">
		<bitfield id="MEM_END" width="32" begin="31" end="0" resetval="0x0" description="External flash end address" range="31 - 0" rwaccess="RW"/>
	</register>
</module>